// /api/categories.js
export default function handler(req, res) {
  if (req.method === "GET") {
    const id = req.query.id;
    const categories = [
      {
        id: "1",
        name: "کفش ورزشی",
        parent_id: null,
      },
      {
        id: "2",
        name: "کفش فوتسال",
        parent_id: 1,
        image:
          "https://www.orglandsports.com/WebsiteImages/ProductGroupImages/948347515.JPG",
        title: "کفش فوتسال اورجینال و کفش سالنی",
        desc: "داشتن یک تجربه ایده آل از فوتسال نیازمند داشتن تجهیزات مناسب و باکیفیت میباشد، همچنین حفظ سلامتی در این ورزش و پیشگیری از آسیب های خطرناک، از اصلی ترین دلایل انتخاب کفش فوتسال مناسب میباشد. با وجود تنوع بسیار زیاد در بازار، خرید کفش فوتسال اورجینال و مناسب کمی دشوار شده، بنابراین در زمان خرید باید به نکات مهمی که در خصوص ویژگی های یک کفش فوتسال خوب وجود دارد، دقت کنید. انتخاب درست در زمان خرید کفش سالنی برای ورزش فوتسال می تواند با جلوگیری از لغزش، تمرکز و تعادل بازیکن را افزایش داده و در حین بازی با داشتن چسبندگی مناسب، کنترل او بر توپ را نیز افزایش دهد. وزن کفش داخل سالن، انعطاف پذیری، تنفس پذیری کفش، نوع زیره و لایه میانی، سایز و پاشنه کفش فوتسال از مهمترین مواردی هستند که باید پیش از خرید بررسی شوند. فروشگاه اورج لند اسپورت با در نظر داشتن اهمیت قیمت کفش های فوتسال اورجینال، محصولات خود را با بهترین قیمت ارائه می کند و امکان مرجوعی یا تعویض کفش های اورجینال خود را تحت شرایطی فراهم کرده است.",
      },
      {
        id: "3",
        name: "کفش پیاده روی",
        parent_id: 1,
        image:
          "https://www.orglandsports.com/WebsiteImages/ProductGroupImages/450912320.JPG",
        title: "خرید کفش پیاده روی",
        desc: "پیاده روی یک فعالیت روتین اما موثر در سلامتی است و کفش هایی که انتخاب می کنید برای داشتن حمایت کافی و راحتی بسیار مهم هستند. چه با هدف گشت و گذار پیاده روی می کنید چه برای ورزش و سلامتی، انتخاب کفش پیاده روی و دویدن مناسب علاوه بر راحتی، از آسیب دیدن پاهایتان جلوگیری می کند. با انتخاب کفش های پیاده روی اورجینال و سبک وزن دیگر نیازی نیست که بار اضافه ای را در مسیر همراه خود بکشانید و می توانید مسیر طولانی تری را به راحتی طی کنید. انواع کفش پیاده روی اورجینال برندهای معتبر خارجی را می توانید با تضمین کیفیت و قیمت منصفانه در فروشگاه اورجلند پیدا کنید. در فروشگاه تخصصی اورج لند، کفش های پیاده روی و کفش های رانینگ اصل با ضمانت 150 درصدی اصالت کالاها ارائه می شود که خیال شما را از بابت اصل بودن آنها راحت می کند.",
      },
      {
        id: "4",
        name: "کفش فوتبال",
        parent_id: 1,
        image:
          "https://www.orglandsports.com/WebsiteImages/ProductGroupImages/638878700.JPG",
        title: "کفش چمن مصنوعی",
        desc: "کفش چمن مصنوعی باید دارای یک سری ویژگی هایی باشد که علاوه بر محافظت از پاهای شما تجربه لذت از بازی کردن را نیز به همراه داشته باشد. در قسمت زیره کفشهای چمن مصنوعی از استوک و پلاستیک های ریز استفاده شده که مانع سر خوردن بازیکن میشود و همچنین از مقاومت بالایی بر خوردار باشد که به راحتی نشکند. یکی از دلایلی که ما کفش های استوک یا کفش های فوتسالی را برای بازی در چمن مصنوعی پیشنهاد نمیکنیم همین مورد لیز خوردن بازیکن و اسیب دیدن بازیکن وکفش میباشد . کفش چمن مصنوعی از برندهای مشهوری مانند نایک، جوما و آدیداس به گونه ای طراحی شده که کشش، دوام و راحتی بی نظیری را در چمن مصنوعی و سطوح زمین محکم به شما ارائه دهد. در فروشگاه اورج لند تمام تلاش ما بر این است که قوی ترین کفشهای چمن مصنوعی از برندهای مطرح دنیا را فقط و فقط با کیفیت اورجینال برای شما عزیزان فراهم کنیم.",
      },
      {
        id: "5",
        name: "پوشاک ورزشی",
        parent_id: null,
      },
      {
        id: "6",
        name: "جوراب",
        parent_id: 5,
        image:
          "https://www.orglandsports.com/WebsiteImages/ProductGroupImages/53048383.JPG",
        title: "خرید جوراب",
        desc: "همواره یکی از لوازم مهم مورد استفاده ورزشکاران جوراب مناسب میباشد  با توجه به دغدغه شما عزیزان و مشکلاتی از قبیل افت کیفیت مثل از دست دادن خاصیت کشسانی و سفت شدن بافت جوراب و... فروشگاه اورج لند سعی خود را بر این دارد تا از بهترین و معتبرترین برند های داخلی و خارجی محصولات خود را تامین کند.",
      },
      {
        id: "7",
        name: "شلوار گلری",
        parent_id: 5,
        image:
          "https://www.orglandsports.com/WebsiteImages/ProductGroupImages/733231789.JPG",
        title: "",
        desc: "یکی از اصلی ترین دغدغه های گلرها اسیب دیدن زانوها بر اثر اصطکاک با کفپوش و کناره های ران در حین شیرجه می باشد، به همین دلیل شلوارهای گلری با دارا بودن پد محافظ زانو و کناره ها تا حد قابل قبولی از این آسیب جلوگیری میکند .با توجه به آسیب های فراوان رشته فوتسال شلوار گلری از ملزومات دروازه بانان فوتسال در همه سطوح، حتی اماتور جهت جلوگیری از آسیب دیدن میباشد جنس پارچه استفاده شده در شلوار گلری فرهنگ نام دارد که از پلی استر و استرج تولید شده است و کاملا نسوز و با دوام بالا می باشد .شما میتوانید با کیفیت ترین شلوارهای گلری فوتسال از جمله شلوار مدل گلری سندبادی را در رنگها و سایزهای مختلف از فروشگاه اورج لند تهیه کنید.",
      },
      {
        id: "8",
        name: "لوازم ورزشی",
        parent_id: 8,
      },
      {
        id: "9",
        name: "کیف و کوله",
        parent_id: 9,
      },
      {
        id: "10",
        name: "توپ",
        parent_id: 10,
      },
    ];
    res.status(200).json(categories);
  } else {
    res.setHeader("Allow", ["GET", "POST"]);
    res.status(405).end(`Method ${req.method} Not Allowed`);
  }
}
